In [3]:
import pandas as pd

# Left Joints

In [8]:
Students = pd.DataFrame({
    "Role_no" :[101, 102, 103, 104],
    "Name"    :["Ahmed","Mohamed","Qalid","fraxaan"],
    "marks"    :[60, 92, 90, 80],
    "Grade"    :["C","A","A", "B"],
    "Cities"   :["Bosaso","Baydaba","Hargessa","Kismanyo"]
})

In [9]:
City_state_maping = pd.DataFrame({
    "Cities" :["Bosaso","Baydaba","Hargessa","Kismanyo","Mogadishu"],
    "State"  :["Puntuland","KGS","SLD","JPL","Banadir"]
})

In [13]:
left_jion = Students.merge(City_state_maping, how="left", on ="Cities")

In [14]:
left_jion

   Role_no     Name  marks Grade    Cities      State
0      101    Ahmed     60     C    Bosaso  Puntuland
1      102  Mohamed     92     A   Baydaba        KGS
2      103    Qalid     90     A  Hargessa        SLD
3      104  fraxaan     80     B  Kismanyo        JPL

# Right Joints

In [40]:
Role_no = pd.DataFrame({
    "Role_no" : [101,104,120,200],
    "package" : [1.2, 5.6, 6.7, 8.2]
})

In [43]:
std = pd.DataFrame({
    "Role_no" :[101, 102, 103, 104],
    "Collage" : ["JAMHURIYA UNV","JAMHURIYA UNV","JAMHURIYA UNV","JAMHURIYA UNV"],
    "Name"    :["Ahmed","Mohamed","Qalid","fraxaan"],
    "marks"    :[60, 92, 90, 80],
    "Grade"    :["C","A","A", "B"],
    "Cities"   :["Bosaso","Baydaba","Hargessa","Kismanyo"]
})

In [44]:
Rigth_Join = std.merge(Role_no,how="right" ,on = "Role_no")

In [45]:
Rigth_Join

   Role_no        Collage     Name  marks Grade    Cities  package
0      101  JAMHURIYA UNV    Ahmed   60.0     C    Bosaso      1.2
1      104  JAMHURIYA UNV  fraxaan   80.0     B  Kismanyo      5.6
2      120            NaN      NaN    NaN   NaN       NaN      6.7
3      200            NaN      NaN    NaN   NaN       NaN      8.2

# Full Joints

In [32]:
Student_selection = pd.DataFrame({
    "Role_no" : [103,102,108],
    "Canpany" : ["abc","xyz","ghy"]
})

In [33]:
Full_joint = Students.merge(Student_selection, how = "outer" ,on ='Role_no' )

In [34]:
Full_joint

   Role_no     Name  marks Grade    Cities Canpany
0      101    Ahmed   60.0     C    Bosaso     NaN
1      102  Mohamed   92.0     A   Baydaba     xyz
2      103    Qalid   90.0     A  Hargessa     abc
3      104  fraxaan   80.0     B  Kismanyo     NaN
4      108      NaN    NaN   NaN       NaN     ghy

# Inner Joints

In [25]:
std = pd.DataFrame({
    "Role_no" :[101, 102, 103, 104],
    "Collage" : ["JAMHURIYA UNV","JAMHURIYA UNV","JAMHURIYA UNV","JAMHURIYA UNV"],
    "Name"    :["Ahmed","Mohamed","Qalid","fraxaan"],
    "marks"    :[60, 92, 90, 80],
    "Grade"    :["C","A","A", "B"],
    "Cities"   :["Bosaso","Baydaba","Hargessa","Kismanyo"]
})

In [26]:
pool = pd.DataFrame({
      "Collage" : ["JAMHURIYA UNV","Simad UNV","JAMHURIYA UNV","Simad UNV"],
       "Name"    :["Ahmed","Abudi","Qalid","Leylo"],
        "Canpany" : ["abc","xyz","abc","cxy"]
})

In [28]:
inner_Join = std.merge(pool, how = "inner", on = ["Name", "Collage"])

In [29]:
inner_Join

   Role_no        Collage   Name  marks Grade    Cities Canpany
0      101  JAMHURIYA UNV  Ahmed     60     C    Bosaso     abc
1      103  JAMHURIYA UNV  Qalid     90     A  Hargessa     abc